//Задание №2. В каждой строке заданной матрицы A(N, M) вычислить сумму, количество и среднее арифметическое 

#include <iostream> 
using namespace std;

//void main()
//{
//	setlocale(LC_CTYPE, "russian");
//	const int N = 3;
//	const int M = 3;
//	const int u = 3;
//	int sum[u] = { 0 }, kol[u] = { 0 }, sr[u] = {0};
//	int a[N][M] = { { 1,2,5 },{ 3,9,4 },{ 5,8,6 } };
//	int i, j;
//	for (i = 0; i < N; i++) {
//		for (j = 0; j < M; j++) {
//			sum[i] += a[i][j];
//			kol[i] += 1;
//			sr[i] = sum[i] / kol[i];
//		}
//	}
//	for (i = 0; i < N; i++) {
//		cout << "Для строки " << i << endl;
//        cout << "Сумма: " << sum[i] << endl;
//        cout << "Количество: " << kol[i] << endl;
//        cout << "Среднее арифметическое: " << sr[i] << endl;
//        cout << "\n" << endl;
//	}
//}

//С помощью указателей----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//void main()
//{
//	setlocale(LC_CTYPE, "russian");
//	const int N = 3;
//	const int M = 3;
//	const int u = 3;
//	int sum[u] = { 0 }, kol[u] = { 0 }, sr[u] = { 0 };
//	int a[N][M] = { { 1,2,5 },{ 3,9,4 },{ 5,8,6 } };
//	int i, j;
//	for (i = 0; i < N; i++) {
//		for (j = 0; j < M; j++) {
//			*(sum + i) += *(*(a + i) + j);
//			*(kol + i) += 1;
//			*(sr + i) = *(sum + i) / *(kol + i);
//		}
//	}
//	for (i = 0; i < N; i++) {
//		cout << "Для строки " << i << endl;
//		cout << "Сумма: " << *(sum + i) << endl;
//		cout << "Количество: " << *(kol + i) << endl;
//		cout << "Среднее арифметическое: " << *(sr + i) << endl;
//		cout << "\n" << endl;
//	}
//}

//Задание №4. Дана матрица A(N, M). Найти количество элементов этой матрицы, больших среднего арифметического всех её элементов.--------------------------------------------------------------------------------------------------------------------

void main()
{
	setlocale(LC_CTYPE, "russian");
	const int N = 3;
	const int M = 3;
	const int u = 3;
	float sum = 0, kol = 0, sr = 0, kolvo = 0;
	int a[N][M] = { { 1,2,5 },{ 3,9,4 },{ 5,8,6 } };
	int i, j;
	for (i = 0; i < N; i++) {
		for (j = 0; j < M; j++) {
			sum += a[i][j];
			kol += 1;
		}
	}
	sr = sum / kol;
	for (i = 0; i < N; i++) {
		for (j = 0; j < M; j++) {
			if (a[i][j] > sr) {
				kolvo += 1;
			}
		}
	}
	cout << "Количество элементов, больших среднего арифметического - " << kolvo << endl;
}

// С помощью указателей----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//void main()
//{
//	setlocale(LC_CTYPE, "russian");
//	const int N = 3;
//	const int M = 3;
//	const int u = 3;
//	float sum = 0, kol = 0, sr = 0;
//	int kolvo = 0;
//	int a[N][M] = { { 1,2,5 },{ 3,9,4 },{ 5,8,6 } };
//	int i, j;
//	for (i = 0; i < N; i++) {
//		for (j = 0; j < M; j++) {
//			sum += *(*(a + i) + j);
//			kol += 1;
//		}
//	}
//	sr = sum / kol;
//	for (i = 0; i < N; i++) {
//		for (j = 0; j < M; j++) {
//			if ((*(*a + i) + j) > sr) {
//				kolvo += 1;
//			}
//		}
//	}
//	cout << "Количество элементов, больших среднего арифметического - " << kolvo << endl;
//}